Feature: CalculateGameResult
	In order to avoid silly mistakes
	As a math idiot
	I want to be told the sum of two numbers

@mock
Background: Initialize
	Given Setup mocking
	And ผู้ใช้ในระบบมีดังนี้
	| Id | SecretCode  | Points | MaximumGuessAmount | CurrentOrderedCoupon |
	| 1  | s01         | 0      | 5                  | 0                    |
	
@mock
Scenario: Add two numbers
	Given I have entered 50 into the calculator
	And I have entered 70 into the calculator
	When I press add
	Then the result should be 120 on the screen

#คำนวณผลคะแนนในตอนที่ไม่มีข้อมูลแมช์ ระบบไม่ทำการคำนวณผลคะแนน
#คำนวณผลคะแนนในตอนที่มีแต่แมช์ในอดีตที่คำนวณผลคะแนนไปแล้ว ระบบไม่ทำการคำนวณผลคะแนน
#คำนวณผลคะแนนในตอนที่มีแต่แมช์ในอนาคต ระบบไม่ทำการคำนวณผลคะแนน
#คำนวณผลคะแนนในตอนที่มีแต่แมช์ปัจจุบันที่ยังไม่จบ ระบบไม่ทำการคำนวณผลคะแนน
#คำนวณผลคะแนนในตอนที่มีแต่แมช์ปัจจุบันที่ถูกนวณผลไปแล้ว ระบบไม่ทำการคำนวณผลคะแนน
#คำนวณผลคะแนนในตอนที่มีแต่แมช์ปัจจุบันที่ยังไม่ถูกนวณผล (มีผู้ใช้ทายผลในแมช์เหล่านั้น) ระบบทำการคำนวณผลคะแนน
#คำนวณผลคะแนนในตอนที่มีแต่แมช์ปัจจุบันที่ยังไม่ถูกนวณผล (ไม่มีผู้ใช้ทายผลในแมช์เหล่านั้น) ระบบทำการคำนวณผลคะแนน
#คำนวณผลคะแนนในตอนที่มีแต่แมช์ในอดีตที่ยังไม่คำนวณผลคะแนน (มีผู้ใช้ทายผลในแมช์เหล่านั้น) ระบบทำการคำนวณผลคะแนน
#คำนวณผลคะแนนในตอนที่มีแต่แมช์ในอดีตที่ยังไม่คำนวณผลคะแนน (ไม่มีผู้ใช้ทายผลในแมช์เหล่านั้น) ระบบทำการคำนวณผลคะแนน