Feature: GetGuessHistoryByMonth
	In order to avoid silly mistakes
	As a math idiot
	I want to be told the sum of two numbers

@mock
Background: Initialize
	Given Setup mocking

@mock
Scenario: Add two numbers
	Given I have entered 50 into the calculator
	And I have entered 70 into the calculator
	When I press add
	Then the result should be 120 on the screen

#ผู้ใช้ขอข้อมูลการทายผลรายเดือนในปีที่ไม่มีแมช์ ระบบส่งรายการทายผลเปล่ากลับไป	
#ผู้ใช้ขอข้อมูลการทายผลรายเดือนในเดือนที่ไม่มีแมช์ ระบบส่งรายการทายผลเปล่ากลับไป
#ผู้ใช้ขอข้อมูลการทายผลรายเดือนในเดือนที่ตัวเองไม่ได้ทายผล ระบบส่งรายการทายผลเปล่ากลับไป
#ผู้ใช้ขอข้อมูลการทายผลรายเดือนในเดือนที่ตัวเองมีการทายผลไว้วันเดียว ระบบส่งรายการทายผลในเดือนนั้นทั้งหมดกลับไป
#ผู้ใช้ขอข้อมูลการทายผลรายเดือนในเดือนที่ตัวเองมีการทายผลไว้หลายวัน ระบบส่งรายการทายผลในเดือนนั้นทั้งหมดกลับไป

#ผู้ใช้ขอข้อมูลการทายผลรายเดือนแต่ปีที่ส่งไปไม่ถูกต้อง ระบบส่งรายการทายผลเปล่ากลับไป
#ผู้ใช้ขอข้อมูลการทายผลรายเดือนแต่เดือนที่ส่งไปไม่ถูกต้อง ระบบส่งรายการทายผลเปล่ากลับไป
#ผู้ใช้ที่ไม่มีในระบบขอข้อมูลการทายผลรายเดือน ระบบส่งรายการทายผลเปล่ากลับไป