Feature: GetMatches
	In order to avoid silly mistakes
	As a math idiot
	I want to be told the sum of two numbers

@mock
Scenario: ขอแมช์ในตอนที่เซิฟเวอร์ไม่มีข้อมูลแมช์อยู่เลย ระบบส่งแมช์เปล่ากลับไป
	Given I have entered 50 into the calculator
	And I have entered 70 into the calculator
	When I press add
	Then the result should be 120 on the screen


#ผู้ใช้ขอแมช์ในตอนที่เซิฟเวอร์ไม่มีข้อมูลแมช์อยู่เลย ระบบส่งแมช์เปล่ากลับไป

#ผู้ใช้ข้อแมช์ในตอนที่เซิฟเวอร์มีแต่แมช์ปัจจุบันที่มีแต่รายการที่ยังไม่แข่ง ระบบส่งแมช์ปัจจุบันกลับไป
#ผู้ใช้ข้อแมช์ในตอนที่เซิฟเวอร์มีแต่แมช์ปัจจุบันที่มีแต่รายการที่กำลังแข่ง ระบบส่งแมช์ปัจจุบันกลับไป
#ผู้ใช้ข้อแมช์ในตอนที่เซิฟเวอร์มีแต่แมช์ปัจจุบันที่มีแต่รายการที่แข่งจบแล้ว ระบบส่งแมช์ปัจจุบันกลับไป
#ผู้ใช้ข้อแมช์ในตอนที่เซิฟเวอร์มีแต่แมช์ปัจจุบันที่มีรายการแข่งขันทุกประเภท ระบบส่งแมช์ปัจจุบันกลับไป

#ผู้ใช้ขอแมช์ในตอนที่เซิฟเวอร์มีแต่แมช์ที่ผ่านมาแล้ว ระบบส่งแมช์ที่ผ่านมาแล้วที่ไม่เกิน 2 วันย้อนหลังกลับไป
#ผู้ใช้ขอแมช์ในตอนที่เซิฟเวอร์มีแต่แมช์ในอนาคต ระบบส่งแมช์ในอนาคตที่ไม่เกิน 2 วันในอนาคตกลับไป
#ผู้ใช้ขอแมช์ในตอนที่เซิฟเวอร์มีข้อมูลอดีต, ปัจจุบัน, อนาคต ระบบส่งข้อมูลแมช์อดีตที่ไม่เกิน 2 วันย้อนหลัง, แมช์ปัจจุบัน, แมช์ในอนาคตที่ไม่เกิน 2 วันในอนาคตกลับไป