Feature: GetYourRewards
	In order to avoid silly mistakes
	As a math idiot
	I want to be told the sum of two numbers

@mock
Background: Initialize
	Given Setup mocking

@mock
Scenario: Add two numbers
	Given I have entered 50 into the calculator
	And I have entered 70 into the calculator
	When I press add
	Then the result should be 120 on the screen

#ผู้ใช้ที่ไม่เคยได้รับของรางวัล ขอข้อมูลของรางวัลที่เคยได้ ระบบส่งรายการของรางวัลที่เคยได้เปล่ากลับไป
#ผู้ใช้มีของรางวัลที่เคยได้ชิ้นเดียว ขอข้อมูลของรางวัลที่เคยได้ ระบบส่งรายการของรางวัลที่เคยได้ทั้งหมดกลับไป
#ผู้ใช้มีของรางวัลที่เคยได้หลายเดียว (ของรางวัลเดือนก่อนหน้าทั้งหมด) ขอข้อมูลของรางวัลที่เคยได้ ระบบส่งรายการของรางวัลที่เคยได้ทั้งหมดกลับไป
#ผู้ใช้มีของรางวัลที่เคยได้หลายเดียว (ของรางวัลที่ผ่านมานานแล้วทั้งหมด) ขอข้อมูลของรางวัลที่เคยได้ ระบบส่งรายการของรางวัลที่เคยได้ทั้งหมดกลับไป
#ผู้ใช้มีของรางวัลที่เคยได้หลายเดียว (ของรางวัลเดือนก่อนและผ่านมาแล้ว) ขอข้อมูลของรางวัลที่เคยได้ ระบบส่งรายการของรางวัลที่เคยได้ทั้งหมดกลับไป