Feature: GuessMatch
	In order to avoid silly mistakes
	As a math idiot
	I want to be told the sum of two numbers

@mock
Background: Initialize
	Given Setup mocking
	And ในระบบมีข้อมูลแมช์เป็น
	| Id | LeagueName     | BeginDate      | StartedDate | CompletedDate | TeamHome.Id | TeamHome.Name   |TeamHome.CurrentPredictionPoints	|TeamAway.Id | TeamAway.Name    |TeamAway.CurrentPredictionPoints	|
	| 1  | Premier league | 1/1/2015 01:00 |             |               | 1           | Brentford       |6									|2           | Hull City        |7									|
	| 2  | Premier league | 1/1/2015 01:30 |             |               | 3           | Birmingham City |8									|4           | Blackburn Rovers |9									|
	And ผู้ใช้ในระบบมีดังนี้
	| Id | SecrectCode | Points | MaximumGuessAmount | CurrentOrderedCoupon |
	| 1  | s01         | 0      | 5                  | 0                    |

@mock
Scenario: ทายผลว่าทีมเย่าชนะให้กับแมช์ที่ยังไม่แข่ง ระบบทำการบันทึกการทายผลไว้
	Given ในระบบมีข้อมูลการทายเป็น
	| Id | AccountSecrectCode | MatchId | GuessTeamId | PredictionPoints |
	When ผู้ใช้ UserId: 's01' ทายผลแมช์ MatchId: '1' IsGuessTeamHome: 'true' เวลาในขณะนั้นเป็น '1/1/2015 04:00'
	Then ระบบทำการบันทึกการทายผลไว้ UserId: 's01', MatchId: '1', GuessTeamId '1', PredictionPoints '6'

#ทายผลว่าทีมเยือนชนะให้กับแมช์ที่ยังไม่แข่ง ระบบทำการบันทึกการทายผลไว้

#ทายผลว่าทีมเย่าชนะให้กับแมช์ที่กำลังแข่ง ระบบทำการบันทึกการทายผลไว้
#ทายผลว่าทีมเยือนชนะให้กับแมช์ที่กำลังแข่ง ระบบทำการบันทึกการทายผลไว้

#ทายผลว่าทีมเย่าชนะให้กับแมช์ที่แข่งจบแล้ว ระบบไม่ทำการบันทึกผล
#ทายผลว่าทีมเยือนชนะให้กับแมช์ที่แข่งจบแล้ว ระบบไม่ทำการบันทึกผล



#เปลี่ยนการทายจากทีมเย่าชนะเป็นทีมเยือนชนะให้กับแมช์ที่ยังไม่แข่ง ระบบทำการบันทึกการทายผลไว้
#เปลี่ยนการทายจากทีมเยือนชนะเป็นทีมเย่าชนะให้กับแมช์ที่ยังไม่แข่ง ระบบทำการบันทึกการทายผลไว้

#เปลี่ยนการทายจากทีมเย่าชนะเป็นทีมเยือนชนะให้กับแมช์ที่กำลังแข่ง ระบบทำการบันทึกการทายผลไว้
#เปลี่ยนการทายจากทีมเยือนชนะเป็นทีมเย่าชนะให้กับแมช์ที่กำลังแข่ง ระบบทำการบันทึกการทายผลไว้

#เปลี่ยนการทายจากทีมเย่าชนะเป็นทีมเยือนชนะให้กับแมช์ที่แข่งจบแล้ว ระบบไม่ทำการบันทึกผล
#เปลี่ยนการทายจากทีมเยือนชนะเป็นทีมเย่าชนะให้กับแมช์ที่แข่งจบแล้ว ระบบไม่ทำการบันทึกผล

#ทายแมช์ที่ไม่มีในระบบ ระบบไม่ทำการบันทึกผล
#ทายทีมที่ไม่มีในระบบ ระบบไม่ทำการบันทึกผล

#ทายผลว่าทีมเย่าชนะให้กับแมช์ที่ยังไม่แข่งที่อยู่ในอนาคต ระบบไม่ทำการบันทึกผล
#ทายผลว่าทีมเยือนชนะให้กับแมช์ที่ยังไม่แข่งที่อยู่ในอนาคต ระบบไม่ทำการบันทึกผล
